# Pandas Demo

## Series
A **Series** is similar to a numpy array but it can have axis labels so it can be accessed by a label. For more information about Series, click [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html) to check out the Pandas documentation.

In [103]:
import pandas as pd
import numpy as np

In [104]:
# initialize a Series object with custom index labels
labels = ['Jamie', 'John', 'Anna', 'Isabelle']
age_list = [25, 32, 19, 36]
age_series = pd.Series(data=age_list, index=labels)

age_series

Jamie       25
John        32
Anna        19
Isabelle    36
dtype: int64

In [105]:
# initialize a Series object with default index labels
age_series_default = pd.Series(data=age_list)

age_series_default

0    25
1    32
2    19
3    36
dtype: int64

In [106]:
# initialize a Series object using a numpy array as data
age_series_np = pd.Series(data=np.array(age_list))

age_series_np

0    25
1    32
2    19
3    36
dtype: int64

In [107]:
# initialize a Series object using a dictionary, keys are index and values are data
my_dict = {'Jamie': 25, 'John': 32, 'Anna': 19, 'Isabelle': 36}
age_series_dict = pd.Series(my_dict)

age_series_dict

Jamie       25
John        32
Anna        19
Isabelle    36
dtype: int64

In [108]:
# retrieve data using index
age_series_dict['John']

32

## DataFrames
**DataFrames** are data structures for working with tabular data. For more information about DataFrames, click [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) to check out the Pandas documentation.

In [109]:
# set seed first for reproducibility
np.random.seed(10)

# generate random matrix  dim (4,3) - normal distribution
Rnormal = np.random.randn(4,3)

# initialize a DataFrame object with custom index and column names
my_df = pd.DataFrame(data=Rnormal, 
                     index=['row 1', 'row 2', 'row 3', 'row 4'], 
                     columns=['col 1', 'col 2', 'col 3'])

my_df

          col 1     col 2     col 3
row 1  1.331587  0.715279 -1.545400
row 2 -0.008384  0.621336 -0.720086
row 3  0.265512  0.108549  0.004291
row 4 -0.174600  0.433026  1.203037

In [110]:
# print first 2 rows
my_df.head(2)

          col 1     col 2     col 3
row 1  1.331587  0.715279 -1.545400
row 2 -0.008384  0.621336 -0.720086

In [111]:
# print last 2 rows
my_df.tail(2)

          col 1     col 2     col 3
row 3  0.265512  0.108549  0.004291
row 4 -0.174600  0.433026  1.203037

In [112]:
# index DataFrame by column
my_df['col 2']

row 1    0.715279
row 2    0.621336
row 3    0.108549
row 4    0.433026
Name: col 2, dtype: float64

In [113]:
# obtain data without index
my_df['col 2'].values

array([0.71527897, 0.62133597, 0.10854853, 0.43302619])

In [114]:
# index DataFrame by columns
my_df[['col 1', 'col 3']]

          col 1     col 3
row 1  1.331587 -1.545400
row 2 -0.008384 -0.720086
row 3  0.265512  0.004291
row 4 -0.174600  1.203037

In [115]:
# index DataFrame by row name
my_df.loc['row 1']

col 1    1.331587
col 2    0.715279
col 3   -1.545400
Name: row 1, dtype: float64

In [116]:
# index DataFrame by rows
my_df.loc[['row 1', 'row 4']]

          col 1     col 2     col 3
row 1  1.331587  0.715279 -1.545400
row 4 -0.174600  0.433026  1.203037

In [117]:
# index DataFrame by row number
my_df.iloc[0]

col 1    1.331587
col 2    0.715279
col 3   -1.545400
Name: row 1, dtype: float64

In [118]:
# index DataFrame by row and column name
my_df.loc['row 1', 'col 2']

0.7152789743984055

In [119]:
# index DataFrame by row and column number
my_df.iloc[0, 1]

0.7152789743984055

In [120]:
# remove a column
my_df2 = my_df.drop(labels='col 1', axis=1)

my_df2

          col 2     col 3
row 1  0.715279 -1.545400
row 2  0.621336 -0.720086
row 3  0.108549  0.004291
row 4  0.433026  1.203037

In [121]:
# remove multiple columns
my_df3 = my_df.drop(labels=['col 1', 'col 3'], axis=1)

my_df3

          col 2
row 1  0.715279
row 2  0.621336
row 3  0.108549
row 4  0.433026

In [122]:
# remove column in place without assigning result to a new variable
my_df2.drop(labels='col 2', axis=1, inplace=True)

In [123]:
my_df2

          col 3
row 1 -1.545400
row 2 -0.720086
row 3  0.004291
row 4  1.203037

In [124]:
# remove a row
my_df4 = my_df.drop(labels='row 2', axis=0)

my_df4

          col 1     col 2     col 3
row 1  1.331587  0.715279 -1.545400
row 3  0.265512  0.108549  0.004291
row 4 -0.174600  0.433026  1.203037

In [125]:
# create a new columnn
my_df['new column'] = my_df['col 1'] * 2

my_df

          col 1     col 2     col 3  new column
row 1  1.331587  0.715279 -1.545400    2.663173
row 2 -0.008384  0.621336 -0.720086   -0.016768
row 3  0.265512  0.108549  0.004291    0.531023
row 4 -0.174600  0.433026  1.203037   -0.349200

In [126]:
# create a new columnn
my_df['new column2'] = my_df['col 1'] + my_df['col 2']

my_df

          col 1     col 2     col 3  new column  new column2
row 1  1.331587  0.715279 -1.545400    2.663173     2.046865
row 2 -0.008384  0.621336 -0.720086   -0.016768     0.612952
row 3  0.265512  0.108549  0.004291    0.531023     0.374060
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

In [127]:
# logical indexing
# retrieve subset of DataFrame where col 3 is greater than 0
my_df_subset = my_df[my_df['col 3'] > 0] 

my_df_subset

          col 1     col 2     col 3  new column  new column2
row 3  0.265512  0.108549  0.004291    0.531023     0.374060
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

In [128]:
# retrieve subset of DataFrame's second column where col 3 is greater than 0
my_df_subset = my_df[my_df['col 3'] > 0]['col 2']

my_df_subset

row 3    0.108549
row 4    0.433026
Name: col 2, dtype: float64

In [129]:
# retrieve subset of DataFrame where col 3 is greater than 0 and col 1 is less than 0
my_df_subset = my_df[(my_df['col 3'] > 0) & (my_df['col 1'] < 0)] 

my_df_subset

        col 1     col 2     col 3  new column  new column2
row 4 -0.1746  0.433026  1.203037     -0.3492     0.258426

### Reading Data from a CSV File

In [130]:
# read csv file from specified path
df = pd.read_csv('../Data/SalesRecords.csv')

df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

### Writing Data to a CSV File

In [131]:
# write DataFrame to a csv file with specified path
my_df.to_csv('../Data/mydf.csv', index=True)

In [133]:
# read csv written above
my_df = pd.read_csv('../Data/mydf.csv', index_col=0)

my_df.head()

          col 1     col 2     col 3  new column  new column2
row 1  1.331587  0.715279 -1.545400    2.663173     2.046865
row 2 -0.008384  0.621336 -0.720086   -0.016768     0.612952
row 3  0.265512  0.108549  0.004291    0.531023     0.374060
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

### Missing Data

In [135]:
my_df

          col 1     col 2     col 3  new column  new column2
row 1  1.331587  0.715279 -1.545400    2.663173     2.046865
row 2 -0.008384  0.621336 -0.720086   -0.016768     0.612952
row 3  0.265512  0.108549  0.004291    0.531023     0.374060
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

In [140]:
# add some missing values to DataFrame
my_df.iloc[[1,2], [1,3]] = np.nan

In [141]:
my_df

          col 1     col 2     col 3  new column  new column2
row 1  1.331587  0.715279 -1.545400    2.663173     2.046865
row 2 -0.008384       NaN -0.720086         NaN     0.612952
row 3  0.265512       NaN  0.004291         NaN     0.374060
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

In [144]:
# remove rows that contain missing values
my_df2 = my_df.dropna()

my_df2

          col 1     col 2     col 3  new column  new column2
row 1  1.331587  0.715279 -1.545400    2.663173     2.046865
row 4 -0.174600  0.433026  1.203037   -0.349200     0.258426

In [145]:
# remove columns that contain missing values
my_df3 = my_df.dropna(axis=1)

my_df3

          col 1     col 3  new column2
row 1  1.331587 -1.545400     2.046865
row 2 -0.008384 -0.720086     0.612952
row 3  0.265512  0.004291     0.374060
row 4 -0.174600  1.203037     0.258426

In [149]:
# replace missing values with specified value
my_df_no_missing = my_df.fillna(99999)

my_df_no_missing

          col 1         col 2     col 3    new column  new column2
row 1  1.331587      0.715279 -1.545400      2.663173     2.046865
row 2 -0.008384  99999.000000 -0.720086  99999.000000     0.612952
row 3  0.265512  99999.000000  0.004291  99999.000000     0.374060
row 4 -0.174600      0.433026  1.203037     -0.349200     0.258426

### Cardinality and Value Counts

In [152]:
# cardinality of a column, i.e. how many unique countries in a Series
len(df['Country'].unique())

76

In [155]:
# How many of each item are in a Series
df['Region'].value_counts()

Sub-Saharan Africa                   36
Europe                               22
Asia                                 11
Australia and Oceania                11
Middle East and North Africa         10
Central America and the Caribbean     7
North America                         3
Name: Region, dtype: int64

### GroupBy and Aggregations

In [150]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [157]:
# get the average total profit in each region
avg_profit_byregion = df.groupby('Region')['Total Profit'].mean()

avg_profit_byregion

Region
Asia                                 555804.170000
Australia and Oceania                429287.275455
Central America and the Caribbean    406701.121429
Europe                               503769.937727
Middle East and North Africa         576119.186000
North America                        485980.920000
Sub-Saharan Africa                   338422.538889
Name: Total Profit, dtype: float64

In [158]:
# get the total number of units sold in each country
units_sold_bycountry = df.groupby('Country')['Units Sold'].sum()

units_sold_bycountry

Country
Albania                              2269
Angola                               4187
Australia                           12995
Austria                              2847
Azerbaijan                           9255
Bangladesh                           8263
Belize                               5498
Brunei                               6708
Bulgaria                             5660
Burkina Faso                         8082
Cameroon                            10948
Cape Verde                           4168
Comoros                               962
Costa Rica                           6409
Cote d'Ivoire                        3482
Democratic Republic of the Congo     5741
Djibouti                            23198
East Timor                           5908
Federated States of Micronesia       9379
Fiji                                 9905
France                               1815
Gabon                                8656
Grenada                              2804
Haiti                                1705
Honduras                            11199
Iceland                              8867
Iran                                 6489
Kenya                                6457
Kiribati                             5398
Kuwait                                522
                                    ...
Myanmar                             14180
New Zealand                          2187
Nicaragua                            8156
Niger                                3015
Norway                              12574
Pakistan                             9892
Portugal                             1273
Republic of the Congo                6070
Romania                              7910
Russia                               1779
Rwanda                               9539
Samoa                                9654
San Marino                           4750
Sao Tome and Principe               24568
Saudi Arabia                         4063
Senegal                              6593
Sierra Leone                         5890
Slovakia                              171
Slovenia                             4660
Solomon Islands                      2974
South Sudan                          2125
Spain                                4513
Sri Lanka                            6952
Switzerland                          8934
Syria                                3784
The Gambia                          14813
Turkmenistan                         8840
Tuvalu                               9925
United Kingdom                        282
Zambia                               4085
Name: Units Sold, Length: 76, dtype: int64

### DataFrame Summaries and Info

In [159]:
# statistical summaries about each numerical column in DataFrame
df.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [160]:
# info about data types of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 14 columns):
Region            100 non-null object
Country           100 non-null object
Item Type         100 non-null object
Sales Channel     100 non-null object
Order Priority    100 non-null object
Order Date        100 non-null object
Order ID          100 non-null int64
Ship Date         100 non-null object
Units Sold        100 non-null int64
Unit Price        100 non-null float64
Unit Cost         100 non-null float64
Total Revenue     100 non-null float64
Total Cost        100 non-null float64
Total Profit      100 non-null float64
dtypes: float64(5), int64(2), object(7)
memory usage: 11.0+ KB

In [162]:
# DataFrame dimensions
df.shape

(100, 14)